app/controllers/uploads_controller.rb

SELECT `uploads`.* FROM `uploads`
---
  def index
    @uploads = Upload.all

INSERT INTO `uploads` (`photo_content_type`, `updated_at`, `photo_file_name`, `created_at`, `photo_file_size`, `photo_updated_at`, `user_id`) VALUES ('application/pdf', '2011-01-29 23:22:29', 'sample (another copy).pdf', '2011-01-29 23:22:29', 378345, '2011-01-29 23:22:29', NULL)
---
  def create
    newparams = coerce(params)
    @upload = Upload.new(newparams[:upload])
    if @upload.save

SELECT `uploads`.* FROM `uploads` WHERE (`uploads`.`id` = 20) LIMIT 1
---
  def show
    send_file(Upload.find(params[:id]).photo.path)

SELECT `uploads`.* FROM `uploads` WHERE (`uploads`.`id` = 4) LIMIT 1
DELETE FROM `uploads` WHERE (`uploads`.`id` = 4)
---
  def destroy
    @upload = Upload.find(params[:id])
    @upload.destroy